getwd()

dat <- read.csv('./data/ramen.csv', fileEncoding = 'cp932', row.names = '店名')
head(dat)
str(dat)

#標準化
X_scale <- scale(dat)
X_scale

#共分散行列を計算する --> 標準化して共分散行列を計算 = 元データの相関係数
covmat_scaled <- cov(X_scale)
covmat_scaled
cormat <- cor(dat)#-------------------------> 元データの相関係数を試しに計算

#cormatに対してeigenで固有値・固有ベクトルを求める = これが主成分の係数
result <- eigen(cormat)
result

#----------------------------------------------------#
#$values    --> 固有値
#[1] 1.5728539 0.8140083 0.6131378

#$vectors   --> 固有ベクトル
#          [,1]       [,2]       [,3]
#[1,] 0.5715110  0.6044710  0.5549685
#[2,] 0.5221161 -0.7896069  0.3223595
#[3,] 0.6330639  0.1055260 -0.7668731
#----------------------------------------------------#

#行列の掛け算
cormat %*% result$vectors[,1]
#下記と上記は一致する
result$values[1] * result$vectors[,1]

#実は、分散は固有値に一致
#つまり、固有値が大きい順に第１主成分、第２主成分、第３主成分

#寄与率 = 主成分の分散 / 分散の合計
sum(result$values)#-----------------> 分散の合計、標準化したので変数の個数に一致する。
result$values/sum(result$values)#---> 各主成分の寄与率

result$vectors[,1]# ----> 第１主成分
result$vectors[,2]# ----> 第２主成分
result$vectors[,3]# ----> 第３主成分

#主成分得点の計算
X_scale %*% result$vectors

#うまくいかない場合------------> 変数同士の相関がない場合
cormat_n <- diag(c(1,1,1))#----> 単位行列を作る
cormat_n #---------------------> これはつまり変数同士は無相関
eigen(cormat_n)#---------------> 元データの情報と何も変化していない

#主成分分析は相関のある変数を要約した値を凝縮する計算なので、無相関だと意味がない

#主成文分析関数：prcomp関数
result2 <- prcomp(dat, scale=TRUE)
result2

#--------------------------------------------------------------------#
# Standard deviations (1, .., p=3): --------> 主成分の標準偏差
#      [1] 1.2541347 0.9022241 0.7830312

# Rotation (n x k) = (3 x 3):  -------------> 主成分係数=固有ベクトル
#              PC1        PC2        PC3
# 麺     0.5715110 -0.6044710  0.5549685
# 具     0.5221161  0.7896069  0.3223595
# スープ 0.6330639 -0.1055260 -0.7668731
#--------------------------------------------------------------------#

#主成分得点
result2$x


#主成分負荷量
cor(dat, result2$x)#-----> 元データと主成分得点の相関
#これによって、各主成分における各変数の影響度合いがわかる
#実はこれは、係数と主成分の標準偏差の積に等しい
#--------------------------------------------------------------------#
#             PC1        PC2        PC3
#麺     0.7167518 -0.5453683  0.4345576
#具     0.6548039  0.7124024  0.2524175
#スープ 0.7939474 -0.0952081 -0.6004855
#--------------------------------------------------------------------#

#主成分係数と標準偏差の積 = 固有ベクトルと固有値の平方根の積
sweep(result2$rotation,#-----> ベクトル、もしくは行列
      MARGIN = 2,#-----------> 1が行方向、２が列方向
      result2$sdev,#---------> 掛ける統計量
      FUN = '*')#------------> 計算方法。+,-,*,/


result2$rotation
result2$sdev

#biplot
par(family = "ヒラギノ角ゴシック W3")
biplot(result2)


# mtcarsデータ
# 変数が多い

mtcars
str(mtcars)

cor(mtcars)
install.packages('corrplot')
library(corrplot)
corrplot(cor(mtcars))
# 相関があることがわかり、主成分分析をする価値のあるデータであることがわかる

#主成分分析をしてみる、今回は第２主成分まで（rankで表示する数を決めることができる）
result3 <- prcomp(mtcars, scale=TRUE, rank. = 2)
result3

result3$sdev**2/11 #----->寄与率
#---------------------------------------
#0.600763659 
#0.240951627
#0.057017934 
#0.024508858 
#0.020313737 
#0.019236011 
#0.012296544
#0.011172858 
#0.007004241
#0.004730495
#0.002004037
#---------------------------------------

par(family = "ヒラギノ角ゴシック W3", ps=6)
biplot(result3)
#biplotの上と右の数字は元データの尺度？？調べてみる


cor(mtcars, result3$x)
result3$rotation * result3$sdev[1:2]

result3$rotation 
result3$sdev[1:2]


