dat <- read.csv("./lecture05/data/Ramen.csv", fileEncoding = "cp932")
dat2 <- read.csv("./lecture05/data/scores.csv", fileEncoding = "utf-8")

head(dat2) 
str(dat)

#こんなデータがあった時
dat #----------> 行列
dat$麺 #-------> ベクトル
dat[1,] #------> ベクトル

#他の行列の例
cov(dat[,-1])  # 共分散行列
cor(dat[,-1])  # 相関行列

cor(dat2)      # 相関行列
##---> 相関係数行列を求めて、線形代数の技で計算をして、出てきたものをさらに計算する


## 行列の計算
A <- matrix(c(2,1,4,3), ncol = 2) #-------> 先に作ったベクトルをncolで行に分割する
B <- c(10, 6)

solve(A) #--------------------------------> Aの逆行列
solve(A) %*% B #--------------------------> 行列の積、、%*%で行列積を計算する

## 固有値固有ベクトル

A <- matrix(c(3,1,1,2), ncol = 2, byrow = TRUE) #-----> byrow：行方向に数を並べる
eigen(A) #--------------------------------------------> 固有値、固有ベクトルを求める関数

#---結果----------------------------------------------------------#
# eigen() decomposition
# $values
# [1] 3.618034 ---------------------> 固有値
#     1.381966 ---------------------> 固有値その２

# $vectors
#            [,1]       [,2]
# [1,] -0.8506508  0.5257311　　----> 固有ベクトル
# [2,] -0.5257311 -0.8506508    ----> 固有ベクトルその２
#-----------------------------------------------------------------#
